OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1783.h
/*
 * This declarations of the PIC16F1783 MCU.
 *
 * This file is part of the GNU PIC library for SDCC, originally
 * created by Molnar Karoly <molnarkaroly@users.sf.net> 2016.
 *
 * This file is generated automatically by the cinc2h.pl, 2016-04-13 17:23:17 UTC.
 *
 * SDCC is licensed under the GNU Public license (GPL) v2. Note that
 * this license covers the code to the compiler and other executables,
 * but explicitly does not cover any code or objects generated by sdcc.
 *
 * For pic device libraries and header files which are derived from
 * Microchip header (.inc) and linker script (.lkr) files Microchip
 * requires that "The header files should state that they are only to be
 * used with authentic Microchip devices" which makes them incompatible
 * with the GPL. Pic device libraries and header files are located at
 * non-free/lib and non-free/include directories respectively.
 * Sdcc should be run with the --use-non-free command line option in
 * order to include non-free header files and libraries.
 *
 * See http://sdcc.sourceforge.net/ for the latest information on sdcc.
 */

#ifndef __PIC16F1783_H__
#define __PIC16F1783_H__

//==============================================================================
//
//	Register Addresses
//
//==============================================================================

#ifndef NO_ADDR_DEFINES

#define INDF0_ADDR              0x0000
#define INDF1_ADDR              0x0001
#define PCL_ADDR                0x0002
#define STATUS_ADDR             0x0003
#define FSR0_ADDR               0x0004
#define FSR0L_ADDR              0x0004
#define FSR0H_ADDR              0x0005
#define FSR1_ADDR               0x0006
#define FSR1L_ADDR              0x0006
#define FSR1H_ADDR              0x0007
#define BSR_ADDR                0x0008
#define WREG_ADDR               0x0009
#define PCLATH_ADDR             0x000A
#define INTCON_ADDR             0x000B
#define PORTA_ADDR              0x000C
#define PORTB_ADDR              0x000D
#define PORTC_ADDR              0x000E
#define PORTE_ADDR              0x0010
#define PIR1_ADDR               0x0011
#define PIR2_ADDR               0x0012
#define PIR4_ADDR               0x0014
#define TMR0_ADDR               0x0015
#define TMR1_ADDR               0x0016
#define TMR1L_ADDR              0x0016
#define TMR1H_ADDR              0x0017
#define T1CON_ADDR              0x0018
#define T1GCON_ADDR             0x0019
#define TMR2_ADDR               0x001A
#define PR2_ADDR                0x001B
#define T2CON_ADDR              0x001C
#define TRISA_ADDR              0x008C
#define TRISB_ADDR              0x008D
#define TRISC_ADDR              0x008E
#define TRISE_ADDR              0x0090
#define PIE1_ADDR               0x0091
#define PIE2_ADDR               0x0092
#define PIE4_ADDR               0x0094
#define OPTION_REG_ADDR         0x0095
#define PCON_ADDR               0x0096
#define WDTCON_ADDR             0x0097
#define OSCTUNE_ADDR            0x0098
#define OSCCON_ADDR             0x0099
#define OSCSTAT_ADDR            0x009A
#define ADRES_ADDR              0x009B
#define ADRESL_ADDR             0x009B
#define ADRESH_ADDR             0x009C
#define ADCON0_ADDR             0x009D
#define ADCON1_ADDR             0x009E
#define ADCON2_ADDR             0x009F
#define LATA_ADDR               0x010C
#define LATB_ADDR               0x010D
#define LATC_ADDR               0x010E
#define CM1CON0_ADDR            0x0111
#define CM1CON1_ADDR            0x0112
#define CM2CON0_ADDR            0x0113
#define CM2CON1_ADDR            0x0114
#define CMOUT_ADDR              0x0115
#define BORCON_ADDR             0x0116
#define FVRCON_ADDR             0x0117
#define DACCON0_ADDR            0x0118
#define DACCON1_ADDR            0x0119
#define APFCON_ADDR             0x011D
#define APFCON0_ADDR            0x011D
#define CM3CON0_ADDR            0x011E
#define CM3CON1_ADDR            0x011F
#define ANSELA_ADDR             0x018C
#define ANSELB_ADDR             0x018D
#define EEADR_ADDR              0x0191
#define EEADRL_ADDR             0x0191
#define EEADRH_ADDR             0x0192
#define EEDAT_ADDR              0x0193
#define EEDATL_ADDR             0x0193
#define EEDATH_ADDR             0x0194
#define EECON1_ADDR             0x0195
#define EECON2_ADDR             0x0196
#define VREGCON_ADDR            0x0197
#define RC1REG_ADDR             0x0199
#define RCREG_ADDR              0x0199
#define RCREG1_ADDR             0x0199
#define TX1REG_ADDR             0x019A
#define TXREG_ADDR              0x019A
#define TXREG1_ADDR             0x019A
#define SP1BRG_ADDR             0x019B
#define SP1BRGL_ADDR            0x019B
#define SPBRG_ADDR              0x019B
#define SPBRG1_ADDR             0x019B
#define SPBRGL_ADDR             0x019B
#define SP1BRGH_ADDR            0x019C
#define SPBRGH_ADDR             0x019C
#define SPBRGH1_ADDR            0x019C
#define RC1STA_ADDR             0x019D
#define RCSTA_ADDR              0x019D
#define RCSTA1_ADDR             0x019D
#define TX1STA_ADDR             0x019E
#define TXSTA_ADDR              0x019E
#define TXSTA1_ADDR             0x019E
#define BAUD1CON_ADDR           0x019F
#define BAUDCON_ADDR            0x019F
#define BAUDCON1_ADDR           0x019F
#define BAUDCTL_ADDR            0x019F
#define BAUDCTL1_ADDR           0x019F
#define WPUA_ADDR               0x020C
#define WPUB_ADDR               0x020D
#define WPUC_ADDR               0x020E
#define WPUE_ADDR               0x0210
#define SSP1BUF_ADDR            0x0211
#define SSPBUF_ADDR             0x0211
#define SSP1ADD_ADDR            0x0212
#define SSPADD_ADDR             0x0212
#define SSP1MSK_ADDR            0x0213
#define SSPMSK_ADDR             0x0213
#define SSP1STAT_ADDR           0x0214
#define SSPSTAT_ADDR            0x0214
#define SSP1CON_ADDR            0x0215
#define SSPCON_ADDR             0x0215
#define SSPCON1_ADDR            0x0215
#define SSP1CON2_ADDR           0x0216
#define SSPCON2_ADDR            0x0216
#define SSP1CON3_ADDR           0x0217
#define SSPCON3_ADDR            0x0217
#define ODCONA_ADDR             0x028C
#define ODCONB_ADDR             0x028D
#define ODCONC_ADDR             0x028E
#define CCPR1_ADDR              0x0291
#define CCPR1L_ADDR             0x0291
#define CCPR1H_ADDR             0x0292
#define CCP1CON_ADDR            0x0293
#define CCPR2_ADDR              0x0298
#define CCPR2L_ADDR             0x0298
#define CCPR2H_ADDR             0x0299
#define CCP2CON_ADDR            0x029A
#define SLRCONA_ADDR            0x030C
#define SLRCONB_ADDR            0x030D
#define SLRCONC_ADDR            0x030E
#define INLVLA_ADDR             0x038C
#define INLVLB_ADDR             0x038D
#define INLVLC_ADDR             0x038E
#define INLVLE_ADDR             0x0390
#define IOCAP_ADDR              0x0391
#define IOCAN_ADDR              0x0392
#define IOCAF_ADDR              0x0393
#define IOCBP_ADDR              0x0394
#define IOCBN_ADDR              0x0395
#define IOCBF_ADDR              0x0396
#define IOCCP_ADDR              0x0397
#define IOCCN_ADDR              0x0398
#define IOCCF_ADDR              0x0399
#define IOCEP_ADDR              0x039D
#define IOCEN_ADDR              0x039E
#define IOCEF_ADDR              0x039F
#define OPA1CON_ADDR            0x0511
#define OPA2CON_ADDR            0x0513
#define CLKRCON_ADDR            0x051A
#define PSMC1CON_ADDR           0x0811
#define PSMC1MDL_ADDR           0x0812
#define PSMC1SYNC_ADDR          0x0813
#define PSMC1CLK_ADDR           0x0814
#define PSMC1OEN_ADDR           0x0815
#define PSMC1POL_ADDR           0x0816
#define PSMC1BLNK_ADDR          0x0817
#define PSMC1REBS_ADDR          0x0818
#define PSMC1FEBS_ADDR          0x0819
#define PSMC1PHS_ADDR           0x081A
#define PSMC1DCS_ADDR           0x081B
#define PSMC1PRS_ADDR           0x081C
#define PSMC1ASDC_ADDR          0x081D
#define PSMC1ASDL_ADDR          0x081E
#define PSMC1ASDS_ADDR          0x081F
#define PSMC1INT_ADDR           0x0820
#define PSMC1PH_ADDR            0x0821
#define PSMC1PHL_ADDR           0x0821
#define PSMC1PHH_ADDR           0x0822
#define PSMC1DC_ADDR            0x0823
#define PSMC1DCL_ADDR           0x0823
#define PSMC1DCH_ADDR           0x0824
#define PSMC1PR_ADDR            0x0825
#define PSMC1PRL_ADDR           0x0825
#define PSMC1PRH_ADDR           0x0826
#define PSMC1TMR_ADDR           0x0827
#define PSMC1TMRL_ADDR          0x0827
#define PSMC1TMRH_ADDR          0x0828
#define PSMC1DBR_ADDR           0x0829
#define PSMC1DBF_ADDR           0x082A
#define PSMC1BLKR_ADDR          0x082B
#define PSMC1BLKF_ADDR          0x082C
#define PSMC1FFA_ADDR           0x082D
#define PSMC1STR0_ADDR          0x082E
#define PSMC1STR1_ADDR          0x082F
#define PSMC2CON_ADDR           0x0831
#define PSMC2MDL_ADDR           0x0832
#define PSMC2SYNC_ADDR          0x0833
#define PSMC2CLK_ADDR           0x0834
#define PSMC2OEN_ADDR           0x0835
#define PSMC2POL_ADDR           0x0836
#define PSMC2BLNK_ADDR          0x0837
#define PSMC2REBS_ADDR          0x0838
#define PSMC2FEBS_ADDR          0x0839
#define PSMC2PHS_ADDR           0x083A
#define PSMC2DCS_ADDR           0x083B
#define PSMC2PRS_ADDR           0x083C
#define PSMC2ASDC_ADDR          0x083D
#define PSMC2ASDL_ADDR          0x083E
#define PSMC2ASDS_ADDR          0x083F
#define PSMC2INT_ADDR           0x0840
#define PSMC2PH_ADDR            0x0841
#define PSMC2PHL_ADDR           0x0841
#define PSMC2PHH_ADDR           0x0842
#define PSMC2DC_ADDR            0x0843
#define PSMC2DCL_ADDR           0x0843
#define PSMC2DCH_ADDR           0x0844
#define PSMC2PR_ADDR            0x0845
#define PSMC2PRL_ADDR           0x0845
#define PSMC2PRH_ADDR           0x0846
#define PSMC2TMR_ADDR           0x0847
#define PSMC2TMRL_ADDR          0x0847
#define PSMC2TMRH_ADDR          0x0848
#define PSMC2DBR_ADDR           0x0849
#define PSMC2DBF_ADDR           0x084A
#define PSMC2BLKR_ADDR          0x084B
#define PSMC2BLKF_ADDR          0x084C
#define PSMC2FFA_ADDR           0x084D
#define PSMC2STR0_ADDR          0x084E
#define PSMC2STR1_ADDR          0x084F
#define STATUS_SHAD_ADDR        0x0FE4
#define WREG_SHAD_ADDR          0x0FE5
#define BSR_SHAD_ADDR           0x0FE6
#define PCLATH_SHAD_ADDR        0x0FE7
#define FSR0L_SHAD_ADDR         0x0FE8
#define FSR0H_SHAD_ADDR         0x0FE9
#define FSR1L_SHAD_ADDR         0x0FEA
#define FSR1H_SHAD_ADDR         0x0FEB
#define STKPTR_ADDR             0x0FED
#define TOSL_ADDR               0x0FEE
#define TOSH_ADDR               0x0FEF

#endif // #ifndef NO_ADDR_DEFINES

//==============================================================================
//
//	Register Definitions
//
//==============================================================================

